{"posts":[{"title":"代号：蓝河","text":"本作由黑鱼制作组开发 于2020年7月13日，在黑鱼制作组4周年的活动时，作为Demo先行发布。 必须承认，这是一项有点仓促的举动，因为这里面的美术风格并不算很统一，也有不少瑕疵和透视上的问题。因此，您可能会觉得它制作粗糙。而我们的剧本也较当时有了相当大的改动。 并且，由于时间关系，当时采用的是BKEngine来实现。目前我们已经尝试改用Lunatic制作组的Nova框架来重置这份Demo，并在此基础上继续追加新的内容。 我们将向您保证，您看到的有问题美术素材和觉得奇怪的文字，都将在接下来不断更新。 这是一些当时的美术素材的图片，您可以在此浏览 想要了解更多，您可以加入我们的试玩群，获得最新发布的Demo 我们将采用Linux版本管理的规则管理版本号，基于敏捷开发的原则来不断迭代","link":"/2021/codelapisriver/"},{"title":"代号：蜜桃","text":"嗯，其实连代号的英文 都是目前刚刚才定下来的 这作……很遗憾 目前没有任何可以公开出来的文本内容，亦没有任何可以公开出来的美术素材 那么，想要体验更多内容，就进群吧 忘记说了，本作由甜雪制作组负责开发","link":"/2021/codesweetpersici/"},{"title":"关于《Exsistensia:逝夏》女主的身份的解密","text":"这并不算是最完美的答案，依然和我们开发中的设定是有一些出入的 但确实命中了相当多的设定，因此我们选取这部分玩家发言展示出来","link":"/2021/exsistensia-about-the-heroine/"},{"title":"关于今年CNGAL茶话会即将登场的新作","text":"字娘在这里向大家安利我们即将在CNGAL茶话会上正式曝光以及即将Demo的与远东社合作开发的新游戏，猜猜看图商是什么角色？ 这是一对双胞胎姐妹花，长相一模一样，相信之前看过微博推送的朋友应该都很熟悉。剩下的就交给接下来的PV和茶话会节目啦！","link":"/2023/fareast-cngal2023/"},{"title":"Exsistensia:逝夏","text":"名字很奇怪？确实 尤其是这是两段名称组合的情况下 尤其是前面这个英文单词不认识的情况下……英文？（并不是，不过这不重要） 本作由甜雪制作组负责开发 本作在开发期间的代号为暗山，即CodeDarkMount 目前我们已经释放出了一张主视觉图 想要体验更多的试玩版？欢迎加入我们的体验群","link":"/2021/exsistensia-kv/"},{"title":"远东四季故事官网手册对应","text":"大家好，目前远东社正在制作中的远东四季故事商店已正式公开，正在调教电脑的工作中。 现在已经放出Demo试玩版本，不过如果要现在就看看的话，可能还是要等切到test分支上体验。 Steam切分支的方法为右键点击游戏，在已安装的游戏里面点击检查文件，就会显示目前可以使用分支正在检察中。一般十分钟左右就会提示有新的test分支可用，切换到上面就可以体验目前新作的完成程度了！ 目前本网站作为前发行商虽然业已经结束合作，依然希望这一作能卖的好一些，感谢浏览本作品相关内容！ 对本作存在的疑问，可以向我们发邮件 FFSS-Helloworld@charrev.moe 咨询（本邮箱专门受理本作相关业务。） 祝您在浩如烟海的文字中发现故事中的美。","link":"/2025/fareast-manual/"},{"title":"拜拜，Unity","text":"团结引擎并不团结，欢迎行走在自由与开放的命途之上。","link":"/2023/sayonara-unity/"}],"tags":[],"categories":[],"pages":[{"title":"关于我们","text":"我们是字魂凝创，一个专门致力于文字游戏开发的团队。 字魂凝创成立于2021年7月13日，前身是黑鱼制作组和甜雪制作组，并在组织架构调整后成为目前的发行开发分离的字魂凝创游戏。 前身黑鱼制作组于2016年7月13日，由@XIANYU40在银川成立。与@快乐的老鼠宝宝合作后在北京组建字魂凝创游戏。 字魂凝创曾有以下几个“自有开发团队” 黑鱼制作组 / Blackish Production 甜雪制作组 / AmaiYuki Production （暂时停止运作） 指针越界工作室 / PointerOverflow Works （暂时停止运作） 不过事后证明，其实是堪比“过家家”一样的“小作坊”，还是更接近于同人社团的模式，在游戏工业上并没有做出什么贡献也没有什么功绩。 后续开始试着转向独立小团队挖掘和发行，但其实也非常失败，主要还是因为实在没有充沛的资金支持。 @快乐的老鼠宝宝 在因个人事务离职字魂凝创前，承诺的对开源项目的贡献也未能成行。 过往仍有很多不够成熟的post，不过出于对过往历史尊重的目的，尽量做到不修改一字一句，只保证链接正常跳转。 现在，字魂凝创正处于完全休眠的状态。但之前曾承诺跟进的项目，如远东社研发的《远东四季故事：Hello World》等系列作，仍将在力所能及之处提供帮助。 联系方式： 洽谈： admin@charrev.moe","link":"/about/"}]}